# StudentName: Ramakrishna Raju Gangaraju, (gangaraju2@wisc.edu)
## Subject: 573_ Lab01

In [93]:
import numpy as np
import pandas as pd

### Creating List with strings

In [2]:
list1 = ['geog572', 'geog573','geog574','geog575','geog579','geog560']

In [30]:
df1 = pd.DataFrame({"Course Name": list1})
df1['Faculty Name'] = ['Rob','Song Gao','Qin','Rob','A-xing','Song Gao']
df1.head()

  Course Name Faculty Name
0     geog572          Rob
1     geog573     Song Gao
2     geog574          Qin
3     geog575          Rob
4     geog579       A-xing

In [61]:
df2 = df1.rename(columns={"Course Name": "Hello"}, )
df2.head()

     Hello Faculty Name
0  geog572          Rob
1  geog573     Song Gao
2  geog574          Qin
3  geog575          Rob
4  geog579       A-xing

In [32]:
df1.head()

  Course Name Faculty Name
0     geog572          Rob
1     geog573     Song Gao
2     geog574          Qin
3     geog575          Rob
4     geog579       A-xing

In [82]:
data1 = {'course':['geog572', 'geog573','geog574','geog575','geog579','geog560'],
        'prof': ['Rob','Song Gao','Qin','Rob','A-xing','Song Gao'],
        'students':[30,40,25,35,45,20]}

In [83]:
data1= pd.DataFrame(data1)

In [84]:
data1.head()

    course      prof  students
0  geog572       Rob        30
1  geog573  Song Gao        40
2  geog574       Qin        25
3  geog575       Rob        35
4  geog579    A-xing        45

In [85]:
data1['department']='geography'
data1.head()

    course      prof  students department
0  geog572       Rob        30  geography
1  geog573  Song Gao        40  geography
2  geog574       Qin        25  geography
3  geog575       Rob        35  geography
4  geog579    A-xing        45  geography

In [86]:
#to get values at specific location with index name

print(data1.loc[1,'prof'])
print(data1.loc[1:2, ['prof','students']])

Song Gao
       prof  students
1  Song Gao        40
2       Qin        25

In [87]:
# get values at specific locations with index number
print(data1.iloc[2, 1])
print(data1.iloc[1:4, 1:3])

Qin
       prof  students
1  Song Gao        40
2       Qin        25
3       Rob        35

In [88]:
# merge dataframe
data_merge = pd.merge(left=data1, left_on="course", right=data1, right_on="course")
data_merge

,course,prof_x,students_x,department_x,prof_y,students_y,department_y
0,geog572,Rob,30,geography,Rob,30,geography
1,geog573,Song Gao,40,geography,Song Gao,40,geography
2,geog574,Qin,25,geography,Qin,25,geography
3,geog575,Rob,35,geography,Rob,35,geography
4,geog579,A-xing,45,geography,A-xing,45,geography
5,geog560,Song Gao,20,geography,Song Gao,20,geography

In [89]:
#sort values
data1.sort_values(by = 'prof', ascending=False)

    course      prof  students department
1  geog573  Song Gao        40  geography
5  geog560  Song Gao        20  geography
0  geog572       Rob        30  geography
3  geog575       Rob        35  geography
2  geog574       Qin        25  geography
4  geog579    A-xing        45  geography

In [90]:
#to get stats
data1['students'].min()
data1['students'].max()

45

In [91]:
data1.describe()

        students
count   6.000000
mean   32.500000
std     9.354143
min    20.000000
25%    26.250000
50%    32.500000
75%    38.750000
max    45.000000

In [92]:
data1.dtypes

course        object
prof          object
students       int64
department    object
dtype: object